app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if params[:user][:password].blank?
      params[:user].delete(:password)
    end

    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "newguy@example.com"], ["updated_at", "2015-10-18 13:59:22.786825"], ["id", 2]]

  def set_projects
    @projects = Project.order(:name)
---
SELECT "projects".* FROM "projects"  ORDER BY "projects"."name" ASC