app/views/tickets/_form.html.erb

    <p>
      <%= link_to "Add another file", new_attachment_path, remote: true, id: "add_file", data: { params: {index: ticket.attachments.size} } %>
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."ticket_id" = ?  [["ticket_id", 1]]