app/views/tickets/show.html.erb

SELECT  1 AS one FROM "attachments" WHERE "attachments"."ticket_id" = ? LIMIT 1  [["ticket_id", 1]]
SELECT "attachments".* FROM "attachments" WHERE "attachments"."ticket_id" = ?  [["ticket_id", 2]]
---

  <% if @ticket.attachments.any? %>