app/controllers/attachments_controller.rb

SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    attachment = Attachment.find(params[:id])