app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "ticket_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "test"], ["ticket_id", 1], ["author_id", 1], ["created_at", "2015-10-20 16:53:37.348150"], ["updated_at", "2015-10-20 16:53:37.348150"]]
---
  def create
    whitelisted_params = comment_params

    unless policy(@ticket).change_state?
      whitelisted_params.delete(:state_id)
    end

    @comment = @ticket.comments.build(whitelisted_params)
    #@comment = @ticket.comments.build(comment_params)

    @comment.author = current_user
    authorize @comment, :create?

    if @comment.save

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_ticket
    @ticket = Ticket.find(params[:ticket_id])