app/controllers/projects_controller.rb

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Sublime Text 4 beta"], ["description", ""], ["updated_at", "2015-10-18 13:59:23.377637"], ["id", 1]]