app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "description", "project_id", "author_id", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = @project.tickets.new

    whitelisted_params = ticket_params
    unless policy(@ticket).tag?
      whitelisted_params.delete(:tag_names)
    end

    @ticket.attributes = whitelisted_params
    @ticket.author = current_user

    authorize @ticket, :create?

    if @ticket.save

UPDATE "tickets" SET "name" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["name", "Make it really shiny!"], ["updated_at", "2015-10-18 13:59:23.493164"], ["id", 1]]
---
    def update
      authorize @ticket, :update?

      if @ticket.update(ticket_params)

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ?  [["project_id", 1]]
---
  def search
    authorize @project, :show?
    if params[:search].present?
      @tickets = @project.tickets.search(params[:search])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ? AND "tickets"."id" = ? LIMIT 1  [["project_id", 1], ["id", 1]]
---
  def set_ticket
    @ticket = @project.tickets.find(params[:id])